<?php
// +----------------------------------------------------------------------
// | ThinkCMF [ WE CAN DO IT MORE SIMPLE ]
// +----------------------------------------------------------------------
// | Copyright (c) 2013-2017 http://www.thinkcmf.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: WelkinVan <welkinvan@qq.com>
// +----------------------------------------------------------------------
return [
    'image1'     => [
        'title' => '登录背景图一',
        'type'  => 'image',
        'value' => ''
    ],
    'image2'     => [
        'title' => '登录背景图二',
        'type'  => 'image',
        'value' => ''
    ],
    'image3'     => [
        'title' => '登录背景图三',
        'type'  => 'image',
        'value' => ''
    ],
];
					