<?php
// +----------------------------------------------------------------------
// | ThinkCMF [ WE CAN DO IT MORE SIMPLE ]
// +----------------------------------------------------------------------
// | Copyright (c) 2013-2019 http://www.thinkcmf.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 老猫 <thinkcmf@126.com>
// +----------------------------------------------------------------------
return [
    'product_before_assign_item'    => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品显示之前', // 钩子名称
        "description" => "产品显示之前", //钩子描述
        "once"        => 0 // 是否只执行一次
    ],
    'product_admin_after_save_item' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '后台产品保存之后', // 钩子名称
        "description" => "后台产品保存之后", //钩子描述
        "once"        => 0 // 是否只执行一次
    ],
    'product_admin_item_index_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台产品管理列表界面', // 钩子名称
        "description" => "产品后台产品管理列表界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_item_add_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台产品添加界面', // 钩子名称
        "description" => "产品后台产品添加界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_item_edit_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台产品编辑界面', // 钩子名称
        "description" => "产品后台产品编辑界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_category_index_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台产品分类管理列表界面', // 钩子名称
        "description" => "产品后台产品分类管理列表界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_category_add_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台产品分类添加界面', // 钩子名称
        "description" => "产品后台产品分类添加界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_category_edit_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台产品分类编辑界面', // 钩子名称
        "description" => "产品后台产品分类编辑界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_page_index_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台页面管理列表界面', // 钩子名称
        "description" => "产品后台页面管理列表界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_page_add_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台页面添加界面', // 钩子名称
        "description" => "产品后台页面添加界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_page_edit_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台页面编辑界面', // 钩子名称
        "description" => "产品后台页面编辑界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_tag_index_view' => [
        "type"        => 2,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台产品标签管理列表界面', // 钩子名称
        "description" => "产品后台产品标签管理列表界面", //钩子描述
        "once"        => 1 // 是否只执行一次
    ],
    'product_admin_item_edit_view_right_sidebar' => [
        "type"        => 4,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台产品添加编辑界面右侧栏', // 钩子名称
        "description" => "产品后台产品添加编辑界面右侧栏", //钩子描述
        "once"        => 0 // 是否只执行一次
    ],
    'product_admin_item_edit_view_main' => [
        "type"        => 4,//钩子类型(默认为应用钩子;2:应用钩子;3:模板钩子;4:后台模板钩子)
        "name"        => '产品后台产品添加编辑界面主要内容', // 钩子名称
        "description" => "产品后台产品添加编辑界面主要内容", //钩子描述
        "once"        => 0 // 是否只执行一次
    ],
];